; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared6 - mode
	spectrograph1 - mode
	thermograph2 - mode
	thermograph5 - mode
	thermograph0 - mode
	spectrograph4 - mode
	image3 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph5)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared6)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 image3)
	(supports instrument3 infrared6)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 GroundStation2)
	(have_image Star6 spectrograph4)
	(have_image Planet7 thermograph5)
	(have_image Planet7 image3)
	(have_image Star8 thermograph2)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon9 thermograph5)
	(have_image Planet10 thermograph5)
	(have_image Planet11 infrared6)
	(have_image Planet11 spectrograph4)
	(have_image Star12 thermograph5)
))

)

; plan
1. (turn_to satellite1 groundstation3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 13
2. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 13
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 13
4. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 13
5. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 13
6. (take_image satellite0 phenomenon9 instrument2 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 1 of 13
7. (turn_to satellite0 groundstation4 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 13
8. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 13
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 13
10. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 13
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 13
12. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 1 of 13
13. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 13
14. (turn_to satellite0 phenomenon9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 13
15. (take_image satellite0 phenomenon9 instrument0 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 2 of 13
16. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 2 of 13
17. (take_image satellite0 planet10 instrument0 thermograph5)
   added: (have_image planet10 thermograph5)
   goals met: 3 of 13
18. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 3 of 13
19. (take_image satellite0 planet7 instrument0 thermograph5)
   added: (have_image planet7 thermograph5)
   goals met: 4 of 13
20. (turn_to satellite0 star12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star12)
   goals met: 4 of 13
21. (take_image satellite0 star12 instrument0 thermograph5)
   added: (have_image star12 thermograph5)
   goals met: 5 of 13
22. (turn_to satellite0 star0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star0)
   goals met: 6 of 13
23. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 6 of 13
24. (take_image satellite1 planet11 instrument3 infrared6)
   added: (have_image planet11 infrared6)
   goals met: 7 of 13
25. (take_image satellite1 planet11 instrument3 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 8 of 13
26. (turn_to satellite1 planet7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet7)
   goals met: 8 of 13
27. (take_image satellite1 planet7 instrument3 image3)
   added: (have_image planet7 image3)
   goals met: 9 of 13
28. (turn_to satellite1 star6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star6)
   goals met: 9 of 13
29. (take_image satellite1 star6 instrument3 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 10 of 13
30. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   goals met: 11 of 13
31. (turn_to satellite2 groundstation2 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation2)
   goals met: 11 of 13
32. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 11 of 13
33. (turn_to satellite2 star8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star8)
   goals met: 11 of 13
34. (take_image satellite2 star8 instrument4 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 12 of 13
35. (take_image satellite2 star8 instrument4 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 13 of 13
